wegam/STM32F1xWorkSpace/Driver/Components/SCR/ST7789V.C
			dst=Buffer[i+1];
			word=word|dst;			
			//A1=====================显示超限换行
      if(x>MaxH-font)
      {
        x=0;
        y+=font;
      }
      //A2=====================显示到屏尾，从原点开始
      if(y>MaxV-font)
      {
        y=x=0;
      }
      //A3=====================读取点阵数据
			GetBufferLength	=	GT32L32_GetCode(font,word,CodeBuffer);		//从字库中读数据并返回数据长度
			//GetBufferLength	=	GT32L32_GetAntennaCode(3,CodeBuffer);
			//A4=====================写入屏幕
			ST7789V_ShowWord(x,y,font,PenColor,GetBufferLength,CodeBuffer);
			//A5=====================水平显示地址增加
      x+=font;
			i++;		//双字节，减两次			
		}
		else if(('\r'==dst)||('\n'==dst))
		{
			if(('\n'==Buffer[i+1])||('\r'==Buffer[i+1]))
			{
				i++;	//去掉回车符长度
			}
			if(y>MaxV-font)
      {
        y=x=0;
      }
			else
			{
				x=0;
				y+=font;
			}
			goto LCD_ShowJump;
		}
		//B=====================单字节--ASCII字符集
		else
		{			
			//B1=====================显示超限换行
      if(x>MaxH-font/2)//半个宽度
      {
        x=0;
        y+=font;
      }
      //B2=====================显示到屏尾，从原点开始
      if(y>MaxV-font)
      {
        y=x=0;
      }
      //B3=====================读取点阵数据
			GetBufferLength	=	GT32L32_GetCode(font,(u16)dst,CodeBuffer);		//从字库中读数据并返回数据长度
			//GetBufferLength	=	GT32L32_GetBatteryCode(3,CodeBuffer);
			//=======================水平制表符按空格显示(部分字库会当0xFF输出)
			if(	('	'	==	(char)dst)		//水平制表符
				||(' '	==	(char)dst))		//空格
			{
				memset(CodeBuffer,0x00,GetBufferLength);
			}
			//B4=====================写入屏幕
			ST7789V_ShowChar(x,y,font,PenColor,GetBufferLength,CodeBuffer);
			//B5=====================水平显示地址增加
      x+=font/2;						
		}
		LCD_ShowJump:
			__nop();
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ST7789V_Test(unsigned short Colr)
{
  unsigned short i=0,j=0;
  
  //ST7789V_PowerOn();
  
  ST7789V_Enable();
  
  //ST7789V_WriteCommand(0x2C); 
  
  ST7789V_SetWindowAddress(0,0,239,319);
    
  for(i=0;i<240;i++)
    for(j=0;j<320;j++)
	{
      ST7789V_WriteData(Colr);
			SysTick_DeleyuS(10);				//SysTick延时nmS
	}
  
  //ST7789V_WriteCommand(0x29);
  
//  for(i=0;i<60000;i++)
//    ST7789V_WriteData(0x00); 
//  
//  ST7789V_WriteCommand(0x29); 
  
  ST7789V_Disable();
}
/*******************************************************************************
* 函数名			:	LCD_Reset
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_Reset(void)
{
//	ST7789VSet(RST);
//	LCD_DelaymS(5);				//SysTick延时nmS
//	ST7789VCrl(RST);;
//	LCD_DelaymS(5);				//SysTick延时nmS
//	ST7789VSet(RST);
//	LCD_DelaymS(10);				//SysTick延时nmS
}
/*******************************************************************************
* 函数名			:	
* 功能描述		:	 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_Enable(void)
{
	ST7789V_DC_HIGH;  //WriteCommand:DC/RS-LOW
  ST7789V_RD_HIGH;  //ReadDisable
  ST7789V_WR_HIGH;  //WriteDisable
  
  ST7789V_CS_LOW;   //SelectLcm
}
/*******************************************************************************
* 函数名			:	
* 功能描述		:	 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_Disable(void)
{
  ST7789V_CS_HIGH;  //Disable LCM
  
  ST7789V_DC_HIGH;  //WriteCommand:DC/RS-LOW
  ST7789V_RD_HIGH;  //ReadDisable
  ST7789V_WR_HIGH;  //WriteDisable
}
/*******************************************************************************
* 函数名			:	
* 功能描述		:	
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_WriteCommand(unsigned short Command)
{
	ST7789V_DC_LOW;   //WriteCommand:DC/RS-LOW
  
  ST7789V_WR_LOW;   //WriteEnable
  ST7789V_DATABUS_PORT->ODR = Command;
  ST7789V_WR_HIGH;  //Read
  
  ST7789V_DC_HIGH;   //WriteCommand:DC/RS-LOW
}
/*******************************************************************************
* 函数名			:	ST7789V_WriteIndex
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_WriteData(unsigned	short	Data)
{
  ST7789V_WR_LOW;   //WriteEnable
  ST7789V_DATABUS_PORT->ODR = Data;
  ST7789V_WR_HIGH;  //Read
}
/*******************************************************************************
* 函数名			:	ST7789V_WriteIndex
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
unsigned short ST7789V_ReadData(void)
{
	unsigned short Data	=	0;
  ST7789V_DC_HIGH;  //WriteData:DC/RS
  ST7789V_WR_HIGH;  //WriteDisable
  
  ST7789V_RD_LOW;   //ReadEnable
  Data  = ST7789V_DATABUS_PORT->IDR;
  ST7789V_RD_HIGH;  //ReadEnable
	return Data;
}

/*******************************************************************************
* 函数名			:	ST7789V_WriteGRAM
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_ReadGRAM(unsigned	short* RAM,unsigned long length)
{
//	unsigned	long	i	=	0;
//	ST7789VCrl(CS);	//LCD_CS_LOW;
//	ST7789V_WriteIndex(0X3E);
//	GPIO_Configuration_IPU	(ST7789V_DATABUS_PORT,ST7789V_DATABUS_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
//	for(i=0;i<length;i++)
//	{
//		RAM[i]=ST7789V_ReadData();
//	}
//	ST7789VSet(CS);	//LCD_CS_HIGH;
//	GPIO_Configuration_OPP50	(ST7789V_DATABUS_PORT,ST7789V_DATABUS_Pin);		//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605	
}
/**************************************************************************************************
* [Function] LCD_PowerOff:  关闭LCD 电源
* [No param]
**************************************************************************************************/
void ST7789V_PowerOff( void )
{
	ST7789V_BL_OFF;		//关背光

