wegam/STM32F1xWorkSpace/Driver/Components/SCR/ST7789V.C
	}
	pST7789V->ST7789VBColor	=	Color;
	ST7789V_Fill(0x00,0x00,HEX,VEY,Color);
}
/**************************************************************************************************
* [Function] ILI9326_SetBackground:  设置背景颜色
* [param01]u16 BackColor: 背景颜色值
**************************************************************************************************/
void ST7789V_SetBackground(  u16 BackColor )
{
	pST7789V->ST7789VBColor	=	BackColor;
	ST7789V_Clean(BackColor);	//清除屏幕函数
}

//
//--------------------------------------------字符显示
//

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ST7789V_ShowChar(
										u16 x,			//x				:起点x坐标
										u16 y,			//y				:起点y坐标
										u8 font,		//font		:字体大小
										u16 color,	//字体颜色
										u8 num,			//num			:字节数
										u8 *Buffer	//Buffer	:显示的内容缓存
										
)		//高通字库测试程序
{
	u8 temp;
	u8 i=0,j=0;
	unsigned short x1=0,x2=0,y1=0,y2=0;
	unsigned short LCD_PEN_COLOR	=	0;   	//画笔色
	x1	=	x;
	y1	=	y;
	x2	=	x+font/2-1;		//
	y2	=	y+font-1;
	
  ST7789V_Enable();	//LCD_CS_LOW;
  
	ST7789V_SetWindowAddress(x1,y1,x2,y2);//设置显示区域	

	for(i=0;i<num;i++)
	{ 
		temp=Buffer[i];		 					//调用1608字体--二维数组形式--字库使用时取消
		for(j=0;j<8;j++)
		{
			if((temp&0x80)==0X80)
			{
				LCD_PEN_COLOR=color;
			}
			else
				LCD_PEN_COLOR=pST7789V->ST7789VBColor	;
			ST7789V_WriteData(LCD_PEN_COLOR);
			temp=temp<<1;
			
		}
    //=======================未满8位的补充定入
    if((24==font)||(12==font))
    {
      temp=Buffer[i+1];		 					
      for(j=0;j<4;j++)
      {
        if((temp&0x80)==0X80)
        {
          LCD_PEN_COLOR=color;
        }
        else
          LCD_PEN_COLOR=pST7789V->ST7789VBColor	;
        ST7789V_WriteData(LCD_PEN_COLOR);
        temp=temp<<1;
      }
      i++;
    }		
	}
	ST7789V_Disable();	//LCD_CS_HIGH;
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ST7789V_ShowChar4836(
										u16 x,			//x				:起点x坐标
										u16 y,			//y				:起点y坐标
										u16 color,	//字体颜色
										u8 *Buffer	//Buffer	:显示的内容缓存
										
)		//高通字库测试程序
{
	u8 temp;
	unsigned short i=0,j=0;
	unsigned short x1=0,x2=0,y1=0,y2=0;
	unsigned short LCD_PEN_COLOR	=	0;   	//画笔色
	x1	=	x;
	y1	=	y;
	x2	=	x+36-1;		//5字节,每行4个半字节
	y2	=	y+48-1;		//48行
	
  ST7789V_Enable();	//LCD_CS_LOW;
  
	ST7789V_SetWindowAddress(x1,y1,x2,y2);//设置显示区域	
	//5*48=240
	for(i=0;i<240;i++)
	{ 
		temp=Buffer[i];		 		//调用1608字体--二维数组形式--字库使用时取消
		if(i%10==4||i%10==9)	//每行第五个字节时只画半个字节
		{
			for(j=0;j<4;j++)
			{
				if((temp&0x80)==0X80)
				{
					LCD_PEN_COLOR=color;
				}
				else
					LCD_PEN_COLOR=pST7789V->ST7789VBColor	;
				ST7789V_WriteData(LCD_PEN_COLOR);
				temp=temp<<1;
			}
		}
		else
		{
			for(j=0;j<8;j++)
			{
				if((temp&0x80)==0X80)
				{
					LCD_PEN_COLOR=color;
				}
				else
					LCD_PEN_COLOR=pST7789V->ST7789VBColor	;
				ST7789V_WriteData(LCD_PEN_COLOR);
				temp=temp<<1;
			}
		}
	}
	ST7789V_Disable();	//LCD_CS_HIGH;
}

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ST7789V_ShowWord(
										u16 x,			//x				:起点x坐标
										u16 y,			//y				:起点y坐标
										u8 font,		//font		:字体大小
										u16 color,	//字体颜色
										u8 num,			//num			:字节数
										u8 *Buffer	//Buffer	:显示的内容缓存
										
)		//高通字库测试程序
{
	u8 temp;
	u8 i=0,j=0;
	unsigned short x1=0,x2=0,y1=0,y2=0;
	unsigned short LCD_PEN_COLOR	=	0;   	//画笔色
	x1	=	x;
	y1	=	y;
  x2	=	x+font-1;
  y2	=	y+font-1;
  
  ST7789V_Enable();	//LCD_CS_LOW;
	ST7789V_SetWindowAddress(x1,y1,x2,y2);//设置显示区域

	for(i=0;i<num;i++)
	{ 
		temp=Buffer[i];		 				
		for(j=0;j<8;j++)
		{
			if((temp&0x80)==0X80)
			{
				LCD_PEN_COLOR=color;
			}
			else
				LCD_PEN_COLOR=pST7789V->ST7789VBColor;
			ST7789V_WriteData(LCD_PEN_COLOR);
			temp=temp<<1;
			
		}
    //=======================未满8位的补充定入
    if((12==font))
    {
      temp=Buffer[i+1];		 					
      for(j=0;j<4;j++)
      {
        if((temp&0x80)==0X80)
        {
          LCD_PEN_COLOR=color;
        }
        else
          LCD_PEN_COLOR=pST7789V->ST7789VBColor	;
        ST7789V_WriteData(LCD_PEN_COLOR);
        temp=temp<<1;
      }
      i++;
    }			
	}
	ST7789V_Disable();	//LCD_CS_HIGH;
}
/*******************************************************************************
* 函数名			:	LCD_DelayuS
* 功能描述		:	延时x微秒
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ST7789V_DelayuS(u32 xuS)
{
	SysTick_DeleyuS(xuS);				//SysTick延时nmS;
}
/*******************************************************************************
* 函数名			:	LCD_DelaymS
* 功能描述		:	延时x毫秒
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ST7789V_DelaymS(u32 xms)
{
	SysTick_DeleymS(xms);				//SysTick延时nmS;
}
/*******************************************************************************
* 函数名			:	LCD_DelayS
* 功能描述		:	延时x秒
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ST7789V_DelayS(u32 xS)
{
	SysTick_DeleyS(xS);				//SysTick延时nmS;
}


